'''
# *Написать программу, которая принимает два числа и математический оператор (+, -, *, /) от пользователя в консоли и выводит результат операции. 
Усложнение:
# *Добавить проверку на деление на ноль.
# *Реализовать поддержку дополнительных операций (например, возведение в степень, модульное деление).
#todo Создать меню для выбора операции.
'''
class Calculator:
    def sum(a, b):
        return a + b
    def minus(a, b):
        return a - b
    def division(a, b):
        if b == 0:
            print('Деление не возможно')
        else: 
            return a / b
    def stepen(a):
        return a*a
    def modul_division(a,b):
        return a % b
    
    def multiplication(a, b):
        return a * b
while True:
    try: 
        print('1) +\n2) -\n3) /\n4) *\n5)^2\n6) %')
        choice = int(input('Введите номер желаемой операции: '))
        if choice == 1:
            print('_________________________________')
            a = int(input('Ввод первого числа: '))
            print('_________________________________')
            b = int(input('Ввод второго числа: '))
            print('_________________________________')
            print('Результат сложения: ', Calculator.sum(a, b))
            print('_________________________________')
        elif choice == 2:
            print('_________________________________')
            a = int(input('Ввод первого числа: '))
            print('_________________________________')
            b = int(input('Ввод второго числа: '))
            print('_________________________________')
            print('Результат вычитания: ', Calculator.minus(a, b))
            print('_________________________________')
        elif choice == 3:
            print('_________________________________')
            a = int(input('Ввод первого числа: '))
            print('_________________________________')
            b = int(input('Ввод второго числа: '))
            print('_________________________________')
            print('Результат деления: ', Calculator.division(a, b))
            print('_________________________________')
        elif choice == 4:
            print('_________________________________')
            a = int(input('Ввод первого числа: '))
            print('_________________________________')
            b = int(input('Ввод второго числа: '))
            print('_________________________________')
            print('Результат умножения: ', Calculator.multiplication(a, b))
            print('_________________________________')
        elif choice == 5:
            print('_________________________________')
            a = int(input('Ввод числа: '))
            print('_________________________________')
            print('Результат возведения в степень: ', Calculator.stepen(a))
            print('_________________________________')
        elif choice == 6:
            print('_________________________________')
            a = int(input('Ввод первого числа: '))
            print('_________________________________')
            b = int(input('Ввод второго числа: '))
            print('_________________________________')
            print('Результат модульного деления: ', Calculator.modul_division(a, b))
            print('_________________________________')
        else:
            print('_________________________________')
            print('Действие не найдено!')
            print('_________________________________')
    except ValueError as e:
        print('_________________________________')
        print('Введите число!')
        print('_________________________________')